---
title: SpatialElementFromToCalculationPoints
classe: Autodesk.Revit.DB.SpatialElementFromToCalculationPoints
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.SpatialElementCalculationLocation
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# SpatialElementFromToCalculationPoints

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `XYZ FromPosition { get; set; }` | `spatialElementFromToCalculationPoints.FromPosition` | XYZ |
| `XYZ ToPosition { get; set; }` | `spatialElementFromToCalculationPoints.ToPosition` | XYZ |
| `Void Flip()` | `spatialElementFromToCalculationPoints.Flip()` | Void |
| `Boolean IsAcceptableFromPosition(XYZ)` | `spatialElementFromToCalculationPoints.IsAcceptableFromPosition(fromPosition)` | Boolean |
| `Boolean IsAcceptableToPosition(XYZ)` | `spatialElementFromToCalculationPoints.IsAcceptableToPosition(toPosition)` | Boolean |
| `XYZ MakeFromPositionAcceptable(XYZ)` | `spatialElementFromToCalculationPoints.MakeFromPositionAcceptable(newFromLocation)` | XYZ |
| `XYZ MakeToPositionAcceptable(XYZ)` | `spatialElementFromToCalculationPoints.MakeToPositionAcceptable(newToLocation)` | XYZ |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```